#### Terraform Plan ('src/domains/cgn/prod') 📖
<details>
<summary>Terraform Plan</summary>

```hcl
                - {
                                  - description = "Merchant Identifier"
                                  - in          = "path"
                                  - minLength   = 1
                                  - name        = "merchantId"
                                  - required    = true
                                  - type        = "string"
                                },
                            ]
                        }
                      - "/offline-merchants"            = {
                          - post = {
                              - description = <<-EOT
                                    List of merchants with physical address, ordered by distance from the user by default
                                EOT
                              - operationId = "getOfflineMerchants"
                              - parameters  = [
                                  - {
                                      - in       = "body"
                                      - name     = "body"
                                      - required = true
                                      - schema   = {
                                          - "$ref" = "#/definitions/OfflineMerchantSearchRequest"
                                        }
                                    },
                                ]
                              - responses   = {
                                  - "200" = {
                                      - description = "List of physical merchants for the given query parameters"
                                      - schema      = {
                                          - "$ref" = "#/definitions/OfflineMerchants"
                                        }
                                    }
                                  - "500" = {
                                      - description = "Service unavailable."
                                      - schema      = {
                                          - "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              - summary     = "List of merchants with a physical address"
                            }
                        }
                      - "/online-merchants"             = {
                          - post = {
                              - description = <<-EOT
                                    List of online merchants alphabetically ordered
                                EOT
                              - operationId = "getOnlineMerchants"
                              - parameters  = [
                                  - {
                                      - in       = "body"
                                      - name     = "body"
                                      - required = false
                                      - schema   = {
                                          - "$ref" = "#/definitions/OnlineMerchantSearchRequest"
                                        }
                                    },
                                ]
                              - responses   = {
                                  - "200" = {
                                      - description = "List of online merchants for the given query parameters"
                                      - schema      = {
                                          - "$ref" = "#/definitions/OnlineMerchants"
                                        }
                                    }
                                  - "500" = {
                                      - description = "Service unavailable."
                                      - schema      = {
                                          - "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              - summary     = "List of online merchants"
                            }
                        }
                      - "/published-product-categories" = {
                          - get = {
                              - description = <<-EOT
                                    List of categories that have at least a published discount
                                EOT
                              - operationId = "getPublishedProductCategories"
                              - responses   = {
                                  - "200" = {
                                      - description = "List of categories that have at least a published discount"
                                      - schema      = {
                                          - "$ref" = "#/definitions/PublishedProductCategories"
                                        }
                                    }
                                  - "500" = {
                                      - description = "Service unavailable."
                                      - schema      = {
                                          - "$ref" = "#/definitions/ProblemJson"
                                        }
                                    }
                                }
                              - summary     = "List of published product categories"
                            }
                        }
                    }
                  - responses           = {
                      - Forbidden      = {
                          - description = "Forbidden"
                        }
                      - InvalidRequest = {
                          - description = "Bad request"
                        }
                      - NotFound       = {
                          - description = "Not found"
                        }
                    }
                  - schemes             = [
                      - "https",
                    ]
                  - security            = [
                      - {
                          - SubscriptionKey = []
                        },
                    ]
                  - securityDefinitions = {
                      - SubscriptionKey = {
                          - description = "The API key to access this function app."
                          - in          = "header"
                          - name        = "Ocp-Apim-Subscription-Key"
                          - type        = "apiKey"
                        }
                    }
                  - swagger             = "2.0"
                }
            ) -> null
        }

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

  # module.apim_itn.module.api_v2_cgn_os.azurerm_api_management_api_policy.this[0] will be destroyed
  # (because azurerm_api_management_api_policy.this is not in configuration)
  - resource "azurerm_api_management_api_policy" "this" {
      - api_management_name = "io-p-itn-apim-01" -> null
      - api_name            = "io-cgn-os-api" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-cgn-os-api" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
      - xml_content         = <<-EOT
            <policies>
            	<inbound>
            		<base />
            		<set-backend-service base-url="{{cgnonboardingportal-os-url}}/api/v1/cgn/operator-search" />
            		<set-header name="x-functions-key" exists-action="override">
            			<value>{{cgnonboardingportal-os-key}}</value>
            		</set-header>
            		<set-header name="{{cgnonboardingportal-os-header-name}}" exists-action="override">
            			<value>true</value>
            		</set-header>
            	</inbound>
            	<outbound>
            		<base />
            	</outbound>
            </policies>
        EOT -> null
    }

  # module.apim_itn.module.api_v2_cgn_os.azurerm_api_management_product_api.this["cgnoperatorsearch"] will be destroyed
  # (because azurerm_api_management_product_api.this is not in configuration)
  - resource "azurerm_api_management_product_api" "this" {
      - api_management_name = "io-p-itn-apim-01" -> null
      - api_name            = "io-cgn-os-api" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/cgnoperatorsearch/apis/io-cgn-os-api" -> null
      - product_id          = "cgnoperatorsearch" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
    }

  # module.apim_itn.module.apim_v2_product_cgn_os.azurerm_api_management_product.this will be destroyed
  # (because azurerm_api_management_product.this is not in configuration)
  - resource "azurerm_api_management_product" "this" {
      - api_management_name   = "io-p-itn-apim-01" -> null
      - approval_required     = false -> null
      - description           = "Product for CGN Operator Search Api" -> null
      - display_name          = "IO CGN API OPERATOR SEARCH" -> null
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/cgnoperatorsearch" -> null
      - product_id            = "cgnoperatorsearch" -> null
      - published             = true -> null
      - resource_group_name   = "io-p-itn-common-rg-01" -> null
      - subscription_required = true -> null
      - subscriptions_limit   = 0 -> null
        # (1 unchanged attribute hidden)
    }

  # module.apim_itn.module.apim_v2_product_cgn_os.azurerm_api_management_product_policy.this[0] will be destroyed
  # (because azurerm_api_management_product_policy.this is not in configuration)
  - resource "azurerm_api_management_product_policy" "this" {
      - api_management_name = "io-p-itn-apim-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/cgnoperatorsearch" -> null
      - product_id          = "cgnoperatorsearch" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
      - xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
            	<inbound>
            		<base />
            		<rate-limit-by-key calls="300" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For"))" remaining-calls-header-name="x-rate-limit-remaining" retry-after-header-name="x-rate-limit-retry-after" />
            	</inbound>
            	<backend>
            		<base />
            	</backend>
            	<outbound>
            		<base />
            	</outbound>
            	<on-error>
            		<base />
            	</on-error>
            </policies>
        EOT -> null
    }

  # module.apim_itn.module.apim_v2_product_merchant.azurerm_api_management_product.this will be destroyed
  # (because azurerm_api_management_product.this is not in configuration)
  - resource "azurerm_api_management_product" "this" {
      - api_management_name   = "io-p-itn-apim-01" -> null
      - approval_required     = false -> null
      - description           = "Product for CGN Merchant Api" -> null
      - display_name          = "IO CGN API MERCHANT" -> null
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/cgnmerchant" -> null
      - product_id            = "cgnmerchant" -> null
      - published             = true -> null
      - resource_group_name   = "io-p-itn-common-rg-01" -> null
      - subscription_required = true -> null
      - subscriptions_limit   = 0 -> null
        # (1 unchanged attribute hidden)
    }

  # module.apim_itn.module.apim_v2_product_merchant.azurerm_api_management_product_policy.this[0] will be destroyed
  # (because azurerm_api_management_product_policy.this is not in configuration)
  - resource "azurerm_api_management_product_policy" "this" {
      - api_management_name = "io-p-itn-apim-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/cgnmerchant" -> null
      - product_id          = "cgnmerchant" -> null
      - resource_group_name = "io-p-itn-common-rg-01" -> null
      - xml_content         = <<-EOT
            <!--
                IMPORTANT:
                - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                - To add a policy, place the cursor at the desired insertion point and select a policy from the sidebar.
                - To remove a policy, delete the corresponding policy statement from the policy document.
                - Position the <base> element within a section element to inherit all policies from the corresponding section element in the enclosing scope.
                - Remove the <base> element to prevent inheriting policies from the corresponding section element in the enclosing scope.
                - Policies are applied in the order of their appearance, from the top down.
                - Comments within policy elements are not supported and may disappear. Place your comments between policy elements or at a higher level scope.
            -->
            <policies>
            	<inbound>
            		<base />
            		<rate-limit-by-key calls="300" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For"))" remaining-calls-header-name="x-rate-limit-remaining" retry-after-header-name="x-rate-limit-retry-after" />
            	</inbound>
            	<backend>
            		<base />
            	</backend>
            	<outbound>
            		<base />
            	</outbound>
            	<on-error>
            		<base />
            	</on-error>
            </policies>
        EOT -> null
    }

  # module.cosmos.module.cosmos_account_cgn.azurerm_cosmosdb_account.this will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-cgn"
        name                                     = "io-p-cosmos-cgn"
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (30 unchanged attributes hidden)

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "io-p-cosmos-cgn-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "io-p-cosmos-cgn-spaincentral" -> null
          - location          = "spaincentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "westeurope"
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }

        # (4 unchanged blocks hidden)
    }

  # module.cosmos.module.cosmos_account_cgn.azurerm_private_endpoint.sql[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "sql" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-cosmos-cgn-sql-endpoint"
        name                          = "io-p-cosmos-cgn-sql-endpoint"
        tags                          = {}
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-cosmos-cgn-sql-endpoint/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn.azurerm_private_endpoint.blob[0] must be replaced
-/+ resource "azurerm_private_endpoint" "blob" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-blob-endpoint" -> (known after apply)
        name                          = "iopcgnfnsdt-blob-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/networkInterfaces/iopcgnfnsdt-blob-endpoint.nic.195f2d01-019f-4397-bcc9-30ee94b0d527"
              - name = "iopcgnfnsdt-blob-endpoint.nic.195f2d01-019f-4397-bcc9-30ee94b0d527"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-blob-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-blob-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "iopcgnfnsdt-blob"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.240.77" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.functions.module.function_cgn.azurerm_private_endpoint.queue[0] must be replaced
-/+ resource "azurerm_private_endpoint" "queue" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-queue-endpoint" -> (known after apply)
        name                          = "iopcgnfnsdt-queue-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/networkInterfaces/iopcgnfnsdt-queue-endpoint.nic.68d4c482-47d3-4080-9ef8-a2fa777a659d"
              - name = "iopcgnfnsdt-queue-endpoint.nic.68d4c482-47d3-4080-9ef8-a2fa777a659d"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-queue-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-queue-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "iopcgnfnsdt-queue"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.240.78" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.functions.module.function_cgn.azurerm_private_endpoint.table[0] must be replaced
-/+ resource "azurerm_private_endpoint" "table" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-table-endpoint" -> (known after apply)
        name                          = "iopcgnfnsdt-table-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/networkInterfaces/iopcgnfnsdt-table-endpoint.nic.2253a81d-9928-4cad-85f1-35742f187ee6"
              - name = "iopcgnfnsdt-table-endpoint.nic.2253a81d-9928-4cad-85f1-35742f187ee6"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-table-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.table.core.windows.net"
              - name                = "privatelink.table.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Network/privateEndpoints/iopcgnfnsdt-table-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "iopcgnfnsdt-table"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.240.76" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.redis.module.redis_cgn.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-redis-cgn-std-private-endpoint" -> (known after apply)
        name                          = "io-p-redis-cgn-std-private-endpoint"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/networkInterfaces/io-p-redis-cgn-std-private-endpoint.nic.18e255e9-af62-4507-9810-3835521c37ce"
              - name = "io-p-redis-cgn-std-private-endpoint.nic.18e255e9-af62-4507-9810-3835521c37ce"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-redis-cgn-std-private-endpoint/privateDnsZoneGroups/io-p-redis-cgn-std-private-dns-zone-group/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Network/privateEndpoints/io-p-redis-cgn-std-private-endpoint/privateDnsZoneGroups/io-p-redis-cgn-std-private-dns-zone-group" -> (known after apply)
            name                 = "io-p-redis-cgn-std-private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "io-p-redis-cgn-std-private-service-connection"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Cache/redis/io-p-redis-cgn-std" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.0.14.4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.redis.module.redis_cgn.azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + minimum_tls_version           = "1.2"
      + name                          = "io-p-redis-cgn-std"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "io-p-rg-cgn"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Standard"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + patch_schedule {
          + day_of_week        = "Sunday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Monday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Tuesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Wednesday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }
      + patch_schedule {
          + day_of_week        = "Thursday"
          + maintenance_window = "PT5H"
          + start_hour_utc     = 23
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = (known after apply)
          + maxmemory_delta                 = (known after apply)
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = (known after apply)
          + rdb_backup_enabled              = false
        }
    }

  # module.functions.module.function_cgn.module.storage_account.azurerm_advanced_threat_protection.this will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = true
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.functions.module.function_cgn.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Insights/metricAlerts/[iopcgnfnst] Low Availability"
        name                     = "[iopcgnfnst] Low Availability"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnst",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn.module.storage_account.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopcgnfnst"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-cgn-be-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.functions.module.function_cgn.module.storage_account_durable_function[0].azurerm_advanced_threat_protection.this will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = false
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.functions.module.function_cgn.module.storage_account_durable_function[0].azurerm_monitor_metric_alert.storage_account_low_availability[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Insights/metricAlerts/[iopcgnfnsdt] Low Availability"
        name                     = "[iopcgnfnsdt] Low Availability"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnfnsdt",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn.module.storage_account_durable_function[0].azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopcgnfnsdt"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-cgn-be-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.functions.module.function_cgn_merchant.module.storage_account.azurerm_advanced_threat_protection.this will be created
  + resource "azurerm_advanced_threat_protection" "this" {
      + enabled            = true
      + id                 = (known after apply)
      + target_resource_id = (known after apply)
    }

  # module.functions.module.function_cgn_merchant.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Insights/metricAlerts/[iopcgnmerchantfnst] Low Availability"
        name                     = "[iopcgnmerchantfnst] Low Availability"
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-cgn-be-rg/providers/Microsoft.Storage/storageAccounts/iopcgnmerchantfnst",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.module.function_cgn_merchant.module.storage_account.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopcgnmerchantfnst"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-cgn-be-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/cgn/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

Plan: 14 to add, 6 to change, 20 to destroy.

Changes to Outputs:
  ~ redis                        = {
      ~ id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-cgn/providers/Microsoft.Cache/redis/io-p-redis-cgn-std" -> (known after apply)
        name = "io-p-redis-cgn-std"
    }

Warning: Deprecated Resource

  with module.functions.azurerm_app_service_plan.app_service_plan_cgn_common,
  on ../_modules/functions_apps/app_service_plan_cgn_common.tf line 1, in resource "azurerm_app_service_plan" "app_service_plan_cgn_common":
   1: resource "azurerm_app_service_plan" "app_service_plan_cgn_common" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and one more similar warning elsewhere)
::error::Terraform exited with code 1.

```

</details>
